anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
#define UART_RX_BUFFER_SIZE  (128)
#define UART_RX_BUFFER_MASK (UART_RX_BUFFER_SIZE - 1)
#if (UART_RX_BUFFER_SIZE & UART_RX_BUFFER_MASK) != 0
#error UART_RX_BUFFER_SIZE must be a power of two and <= 256
#endif

#define UART_TX_BUFFER_SIZE  (128)
#define UART_TX_BUFFER_MASK (UART_TX_BUFFER_SIZE - 1)
#if (UART_TX_BUFFER_SIZE & UART_TX_BUFFER_MASK) != 0
#error UART_TX_BUFFER_SIZE must be a power of two and <= 256
#endif

struct UART_RX_BUFFER
{
    volatile uint8_t head;
    volatile uint8_t tail;
    uint8_t buf[UART_RX_BUFFER_SIZE];
};

struct UART_TX_BUFFER
{
    volatile uint8_t head;
    volatile uint8_t tail;
    uint8_t buf[UART_TX_BUFFER_SIZE];
};

struct UART_BUFFER
{
    struct UART_TX_BUFFER tx;
    struct UART_RX_BUFFER rx;
};

// UART buffers
static struct UART_BUFFER U3Buf;

volatile uint32_t MilliSeconds = 0;


/* delayms --- busy-wait delay for given number of milliseconds */

static void delayms(const uint32_t interval)
{
    const uint32_t now = MilliSeconds;
    
    while ((MilliSeconds - now) < interval)
        ;
}


/* millis --- Arduino-like function to return milliseconds since start-up */

static uint32_t millis(void)
{
    return (MilliSeconds);
}


void __ISR(_TIMER_1_VECTOR, ipl7AUTO) Timer1Handler(void) 
{
    MilliSeconds++;
    
    LATAINV = _LATA_LATA7_MASK; // Toggle RA7, P3 pin 42 (500Hz)
    
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
}


void __ISR(_UART_3_VECTOR, ipl1AUTO) UART3Handler(void) 
{
    if (IFS2bits.U3TXIF)
    {
        if (U3Buf.tx.head != U3Buf.tx.tail) // Is there anything to send?
        {
            const uint8_t tmptail = (U3Buf.tx.tail + 1) & UART_TX_BUFFER_MASK;
            
            U3Buf.tx.tail = tmptail;

            U3TXREG = U3Buf.tx.buf[tmptail];     // Transmit one byte
        }
        else
        {
            IEC2CLR = _IEC2_U3TXIE_MASK;         // Nothing left to send; disable Tx interrupt
        }
        
        IFS2CLR = _IFS2_U3TXIF_MASK;  // Clear UART3 Tx interrupt flag
    }
    
    if (IFS1bits.U3RXIF)
    {
        const uint8_t tmphead = (U3Buf.rx.head + 1) & UART_RX_BUFFER_MASK;
        const uint8_t ch = U3RXREG;   // Read received byte from UART
        
        if (tmphead == U3Buf.rx.tail)   // Is receive buffer full?
        {
             // Buffer is full; discard new byte
        }
        else
        {
            U3Buf.rx.head = tmphead;
            U3Buf.rx.buf[tmphead] = ch;   // Store byte in buffer
        }
        
        IFS1CLR = _IFS1_U3RXIF_MASK;  // Clear UART3 Rx interrupt flag
    }
    
    if (IFS1bits.U3EIF)
    {
        IFS1CLR = _IFS1_U3EIF_MASK;   // Clear UART3 error interrupt flag
    }
}


uint8_t UART3RxByte(void)
{
    const uint8_t tmptail = (U3Buf.rx.tail + 1) & UART_RX_BUFFER_MASK;
    
    while (U3Buf.rx.head == U3Buf.rx.tail)  // Wait, if buffer is empty
        ;
    
    U3Buf.rx.tail = tmptail;
    
    return (U3Buf.rx.buf[tmptail]);
}


void UART3TxByte(const uint8_t data)
{
    const uint8_t tmphead = (U3Buf.tx.head + 1) & UART_TX_BUFFER_MASK;
    
    while (tmphead == U3Buf.tx.tail)   // Wait, if buffer is full
        ;

    U3Buf.tx.buf[tmphead] = data;
    U3Buf.tx.head = tmphead;

    IEC2SET = _IEC2_U3TXIE_MASK;       // Enable UART3 Tx interrupt
}


bool UART3RxAvailable(void)
{
    return (U3Buf.rx.head != U3Buf.rx.tail);
}


void _mon_putc(const char ch)
{
    // See: https://microchipdeveloper.com/faq:81
    if (ch == '\n')
    {
        UART3TxByte('\r');
    }
    
    UART3TxByte(ch); // Connect stdout to UART3
}


/* iliCmd0 --- send a command byte with no parameter bytes */

void iliCmd0(const uint8_t cmd)
{
    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = cmd;
    
    while (PMMODEbits.BUSY)
            ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
}


/* iliCmd1 --- send a command byte followed by 1 parameter byte */

void iliCmd1(const uint8_t cmd, const uint8_t arg1)
{
    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = cmd;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    PMDIN = arg1;
    
    while (PMMODEbits.BUSY)
            ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
}


/* iliCmd4 --- send a command byte followed by 4 parameter bytes */

inline void iliCmd4(const uint8_t cmd, const uint8_t arg1, const uint8_t arg2, const uint8_t arg3, const uint8_t arg4)
{
    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = cmd;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    PMDIN = arg1;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMDIN = arg2;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMDIN = arg3;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMDIN = arg4;
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
}


/* iliCmd15 --- send a command byte followed by 15 parameter bytes */

void iliCmd15(const uint8_t cmd, const uint8_t arg[15])
{
    int i;
    
    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = cmd;
    
    for (i = 0; i < 15; i++)
    {
        while (PMMODEbits.BUSY)
            ;
    
        PMADDRbits.ADDR = 1;
        PMDIN = arg[i];
    }
    
    while (PMMODEbits.BUSY)
            ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
}


/* ili9486_begin --- initialise the 16-bit parallel LCD */

void ili9486_begin(void)
{
    static uint8_t pgamma[15] = {0x0F, 0x1F, 0x1C, 0x0C, 0x0F, 0x08, 0x48,
                                 0x98, 0x37, 0x0A, 0x13, 0x04, 0x11, 0x0D, 0x00};
    static uint8_t ngamma[15] = {0x0F, 0x32, 0x2E, 0x0B, 0x0D, 0x05, 0x47,
                                 0x75, 0x37, 0x06, 0x10, 0x03, 0x24, 0x20, 0x00};
    static uint8_t dgamma[15] = {0x0F, 0x32, 0x2E, 0x0B, 0x0D, 0x05, 0x47,
                                 0x75, 0x37, 0x06, 0x10, 0x03, 0x24, 0x20, 0x00};
    
