anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
    TRISDCLR = _TRISD_TRISD3_MASK;   // RD3 pin 78, P3 pin 28 as output (LCD RESET)
    
    LATDSET = _LATD_LATD3_MASK;
    delayms(20);
    LATDCLR = _LATD_LATD3_MASK;    // Assert display RESET, active LOW
    delayms(20);
    LATDSET = _LATD_LATD3_MASK;
    delayms(20);
    
    iliCmd1(ILI9486_IFMODECTRL, 0x00); // Interface Mode Control
    iliCmd0(ILI9486_SLEEP_OUT);        // Sleep OUT
    delayms(250);
    
    iliCmd1(ILI9486_IFPIXELFMT, 0x55); // Interface Pixel Format, 16 bits / pixel
    iliCmd1(ILI9486_POWERCTRL3, 0x44); // Power Control 3 (For Normal Mode)
    iliCmd4(ILI9486_VCOMCTRL1, 0x00, 0x00, 0x00, 0x00); // VCOM Control 1
    iliCmd15(ILI9486_PGAMCTRL, pgamma);   // PGAMCTRL (Positive Gamma Control)
    iliCmd15(ILI9486_NGAMCTRL, ngamma);   // NGAMCTRL (Negative Gamma Control)
    iliCmd15(ILI9486_DGAMCTRL1, dgamma);  // Digital Gamma Control 1
    iliCmd1(ILI9486_MEMACCTRL, 0x48);  // Memory Access Control, MX | BGR
    
    iliCmd0(ILI9486_DISPLAY_ON);       // Display ON
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
    delayms(250);
}


/* ili9486_fill --- fill display memory with a given pixel */

void ili9486_fill(const uint16_t pixel, const uint32_t n)
{
    int i;
    
    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    
    for (i = 0; i < n; i++)
    {
        while (PMMODEbits.BUSY)
            ;

        PMDIN = pixel;
    }
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


/* ili9486_write --- write pixels to the display memory, from a buffer */

void ili9486_write(const uint16_t buf[], const uint32_t n)
{
    int i;
    const uint16_t *p = buf;
    
    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.ADDR = 1;
    
    for (i = n / 4; i > 0; i--)
    {
        // Pre-fetch pixel and inc pointer. This happens in parallel with the
        // 'busy' time of the PMP, making this tight loop go just a bit faster.
        uint16_t pixel = *p++;
        
        while (PMMODEbits.BUSY)
            ;

        PMDIN = pixel;
        
        pixel = *p++;
        
        while (PMMODEbits.BUSY)
            ;

        PMDIN = pixel;
        
        pixel = *p++;
        
        while (PMMODEbits.BUSY)
            ;

        PMDIN = pixel;
        
        pixel = *p++;
        
        while (PMMODEbits.BUSY)
            ;

        PMDIN = pixel;
    }
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


/* ili9486_fillRect --- fill a rectangle at given co-ordinates with a pixel colour */

void ili9486_fillRect(const int x1, const int y1, const int x2, const int y2, const uint16_t colr)
{
    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);
    ili9486_fill(colr, (1 + x2 - x1) * (1 + y2 - y1));
}


/* ili9486_pixMap --- write pixels to the display memory, in a rectangle */

void ili9486_pixMap(const int x1, const int y1, const int wd, const int ht, const uint16_t *const pixMap)
{
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    
    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);
    ili9486_write(pixMap, wd * ht);
}


void setHline(const int x1, const int x2, const int y, const iliColr fg)
{
    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y >> 8, y, y >> 8, y);
    ili9486_fill(fg, 1 + x2 - x1);
}


inline void setPixel(const int x, const int y, const iliColr fg)
{
    iliCmd4(ILI9486_COL_ADDR, x >> 8, x, x >> 8, x);
    iliCmd4(ILI9486_PAGE_ADDR, y >> 8, y, y >> 8, y);
    
    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    
    while (PMMODEbits.BUSY)
        ;

    PMDIN = fg;     // Actually write the pixel here
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


/* hsvto565 --- convert HSV colour to 565-RGB */

iliColr hsvto565(const int ih, const int is, const int iv)
{
    int i;
    uint8_t ir, ig, ib;
    iliColr rgb565;
    double p, q, t;
    double f;
    double h, s, v;
    double r = 0.0, g = 0.0, b = 0.0;

    // Compute H, S, V as floating-point in range 0..360, 0..1 and 0..1
    h = (double)ih * (360.0 / (double)MAXPRI);
    s = is / (double)MAXPRI;
    v = iv / (double)MAXPRI;

    if (is == 0)    /* No saturation so make a grey */
    {
        ir = iv;
        ig = iv;
        ib = iv;
    }
    else
    {
        if (h >= 359.0)
            h = 0.0;

        h /= 60.0;
        i = (int)h;
        f = h - i;

        p = v * (1.0 - s);
        q = v * (1.0 - (s * f));
        t = v * (1.0 - (s * (1.0 - f)));

        switch (i)
        {
        case 0:
            r = v;
            g = t;
            b = p;
            break;
        case 1:
            r = q;
            g = v;
            b = p;
            break;
        case 2:
            r = p;
            g = v;
            b = t;
            break;
        case 3:
            r = p;
            g = q;
            b = v;
            break;
        case 4:
            r = t;
            g = p;
            b = v;
            break;
        case 5:
            r = v;
            g = p;
            b = q;
            break;
        }

        ir = r * MAXPRI;
        ig = g * MAXPRI;
        ib = b * MAXPRI;
    }

    rgb565 = RGB_ILI(ir, ig, ib);

