anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
    if (x0 > x1)
    {
        x0 = x1;
        x1 += a;
    }

    if (y0 > y1)
    {
        y0 = y1;
    }

    y0 += (b + 1) / 2;
    y1 = y0 - b1;

    a *= 8 * a;
    b1 = 8 * b * b;

    do
    {
        setHline(x0, x1, y0, fg);
        setHline(x0, x1, y1, fg);

        e2 = 2 * err;

        if (e2 <= dy)
        {
            y0++;
            y1--;
            err += dy += a;
        }

        if ((e2 >= dx) || ((2L * err) > dy))
        {
            x0++;
            x1--;
            err += dx += b1;
        }
    } while (x0 <= x1);

    while ((y0 - y1) < b)
    { 
        setHline(x0 - 1, x1 + 1, y0++, fg);
        setHline(x0 - 1, x1 + 1, y1--, fg);
    }
}


static void cpts(const int x0, const int y0, const int x, const int y, const iliColr fg)
{
    setHline(x0 - x, x0 + x, y0 + y, fg);
    setHline(x0 - x, x0 + x, y0 - y, fg);
    setHline(x0 - y, x0 + y, y0 + x, fg);
    setHline(x0 - y, x0 + y, y0 - x, fg);
}


/* circle --- draw a circle using Michener's algorithm */

void circle(const int x0, const int y0, const int r, const iliColr fg)
{
    int x, y;
    int d;

    x = 0;
    y = r;
    d = 3 - (2 * r);

    while (x < y)
    {
        cpts (x0, y0, x, y, fg);

        if (d < 0)
        {
            d += (4 * x) + 6;
        }
        else
        {
            d += (4 * (x - y)) + 10;
            y--;
        }

        x++;
    }

    if (x == y)
       cpts(x0, y0, x, y, fg);
}


/* initMCU --- set up the microcontroller in general */

void initMCU(void)
{
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
}


/* initGPIOs --- set up the GPIO pins */

static void initGPIOs(void)
{
    TRISAbits.TRISA7 = 0;   // RA7 pin 92, P3 pin 42 as output (timer toggle)
    TRISAbits.TRISA6 = 0;   // RA6 pin 91, P3 pin 41 as output (LED1)
    TRISBbits.TRISB9 = 0;   // RB9 pin 33, P2 pin 33 as output (LED2)
}


/* initMillisecondTimer --- set up a timer to interrupt every millisecond */

void initMillisecondTimer(void)
{
    /* Configure Timer 1 for 1kHz/1ms interrupts */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = 40000 - 1;            // Interrupt every 40000 ticks (1ms)
    
    IPC1bits.T1IP = 7;          // Timer 1 interrupt priority 7 (highest)
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    T1CONSET = _T1CON_ON_MASK;  // Enable Timer 1
}


/* initUARTs --- set up UART(s) and buffers, and connect to 'stdout' */

static void initUARTs(void)
{
    const int baud = 9600;
    
    U3Buf.tx.head = 0;
    U3Buf.tx.tail = 0;
    U3Buf.rx.head = 0;
    U3Buf.rx.tail = 0;

    /* Configure PPS */
    RPC1Rbits.RPC1R = 1;    // U3Tx on pin 6, RPC1, P2 pin 6
    U3RXRbits.U3RXR = 10;   // U3Rx on pin 9, RPC4, P2 pin 9 (5V tolerant)
    
    U3MODEbits.UEN = 3;     // Use just Rx/Tx; no handshaking
    
    U3BRG = (40000000 / (baud * 16)) - 1;
    
    IPC9bits.U3IP = 1;          // UART3 interrupt priority 1 (lowest)
    IPC9bits.U3IS = 0;          // UART3 interrupt sub-priority 0
    
    IFS2CLR = _IFS2_U3TXIF_MASK;  // Clear UART3 Tx interrupt flag
    IFS1CLR = _IFS1_U3RXIF_MASK;  // Clear UART3 Rx interrupt flag
    IFS1CLR = _IFS1_U3EIF_MASK;   // Clear UART3 error interrupt flag
    
    IEC1SET = _IEC1_U3RXIE_MASK;  // Enable UART3 Rx interrupt
    IEC1SET = _IEC1_U3EIE_MASK;   // Enable UART3 error interrupt
    
    U3MODESET = _U3MODE_ON_MASK;      // Enable USART3
    U3STASET = _U3STA_UTXEN_MASK | _U3STA_URXEN_MASK; // Enable Rx and Tx
}


/* initPMP --- initialise the Parallel Master Port as a 16-bit Z80-style bus */

static void initPMP(void)
{
    PMMODEbits.MODE16 = 1;  // 16 data bit mode
    PMMODEbits.WAITB = 0;   // Setup time wait states
    PMMODEbits.WAITM = 0;   // Read/write strobe width
    PMMODEbits.WAITE = 0;   // Hold time wait states
    PMMODEbits.IRQM = 0;    // No interrupts
    PMMODEbits.INCM = 0;    // No auto-increment
    PMMODEbits.MODE = 2;    // /WR and /RD mode (Z80 style bus)
    
    PMCONbits.ADRMUX = 0;   // Non-multiplexed address bus
    PMCONbits.PTRDEN = 1;   // Enable the PMRD pin (pin 82, P3 pin 32)
    PMCONbits.PTWREN = 1;   // Enable the PMWR pin (pin 81, P3 pin 31)
    PMCONbits.RDSP = 0;     // PMRD active-LOW
    PMCONbits.WRSP = 0;     // PMWR active-LOW
    PMCONbits.CSF = 2;      // PMCS1 and PMCS2 are Chip Select pins
    PMCONbits.CS1P = 0;     // PMCS1 active-LOW
    PMCONbits.CS2P = 0;     // PMCS2 active-LOW
    
    PMAENbits.PTEN = 0x03 | (1 << 14) | (1 << 15);
    
    PMADDRbits.CS1 = 0;     // PMCS1 inactive (pin 71, P3 pin 21)
    PMADDRbits.CS2 = 0;     // PMCS2 inactive (pin 70, P3 pin 20)
    
    PMCONSET = _PMCON_ON_MASK; // Enable the Parallel Master Port module
}


void main(void)
{
    unsigned int before, after;
    int i, x, y;
    uint8_t str[32];
    iliColr pixels[GRAT_HT];
    uint8_t wave1[GRAT_WD];
    uint8_t wave2[GRAT_WD];
    uint8_t wave3[GRAT_WD];
    uint8_t wave4[GRAT_WD];
    uint16_t xx[256], yy[256];
    float theta1, delta1;
    float theta2, delta2;
    float offset1 = 128.0;
    float offset2 = 192.0;
    bool cursorMode = true;
    int xcursor1 = 34, xcursor2 = 241;
    int ycursor1 = 54, ycursor2 = 237;
    int yshift1 = 22;
    int yshift2 = -22;
    int yshift3 = 64;
    int yshift4 = 32;
    static uint16_t pixMap[64] = {0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f,  // blue
                                  0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f,  // blue
                                  0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0,  // green
                                  0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0,  // green
                                  0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800,  // red
                                  0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800,  // red
                                  0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000,  // black/white
                                  0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff}; // black/white
    
    initMCU();
    initGPIOs();
    initUARTs();
    initPMP();
    initMillisecondTimer();
    
    __builtin_enable_interrupts();     // Global interrupt enable
    
    puts("ILI9486TEST");
    
    ili9486_begin();
    
    generateGraticule(&LCDColours);
    
    // Synthesise four dummy waveforms
    delta1 = (M_PI * 4.0) / (float)GRAT_WD;
    delta2 = (M_PI * 8.0) / (float)GRAT_WD;

    for (x = 0; x < GRAT_WD; x++)
    {
        theta1 = (float)x * delta1;
        theta2 = (float)x * delta2;

        wave1[x] = (sin(theta1) * 50.0) + offset1;
        wave2[x] = (sin(theta2) * 50.0) + offset2;
        wave3[x] = sin(theta1) > 0.0? 32: 0;
        wave4[x] = sin(theta2) > 0.0? 32: 0;
    }
   
    
    ili9486_fill(ILI9486_WHITE, 480u * 320u);
    
    while (1)
    {
        LED1 = 0;
        LED2 = 1;
        ili9486_fillRect(0, 0, 319, 0, ILI9486_WHITE);
        
        delayms(500);
               
